heardrwt/Xiaomi-M365-Display/nRF5_SDK/examples/ble_peripheral/ble_app_hrs_rtx/main.c
#define SEC_PARAM_BOND                   1                                 /**< Perform bonding. */
#define SEC_PARAM_MITM                   0                                 /**< Man In The Middle protection not required. */
#define SEC_PARAM_LESC                   0                                 /**< LE Secure Connections not enabled. */
#define SEC_PARAM_KEYPRESS               0                                 /**< Keypress notifications not enabled. */
#define SEC_PARAM_IO_CAPABILITIES        BLE_GAP_IO_CAPS_NONE              /**< No I/O capabilities. */
#define SEC_PARAM_OOB                    0                                 /**< Out Of Band data not available. */
#define SEC_PARAM_MIN_KEY_SIZE           7                                 /**< Minimum encryption key size. */
#define SEC_PARAM_MAX_KEY_SIZE           16                                /**< Maximum encryption key size. */

#define DEAD_BEEF                        0xDEADBEEF                        /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

#define APP_FEATURE_NOT_SUPPORTED        BLE_GATT_STATUS_ATTERR_APP_BEGIN + 2        /**< Reply when unsupported features are requested. */


static uint16_t  m_conn_handle = BLE_CONN_HANDLE_INVALID; /**< Handle of the current connection. */
static ble_bas_t m_bas;                                   /**< Structure used to identify the battery service. */
static ble_hrs_t m_hrs;                                   /**< Structure used to identify the heart rate service. */
static bool      m_rr_interval_enabled = true;            /**< Flag for enabling and disabling the registration of new RR interval measurements (the purpose of disabling this is just to test sending HRM without RR interval data. */

static sensorsim_cfg_t   m_battery_sim_cfg;               /**< Battery Level sensor simulator configuration. */
static sensorsim_state_t m_battery_sim_state;             /**< Battery Level sensor simulator state. */
static sensorsim_cfg_t   m_heart_rate_sim_cfg;            /**< Heart Rate sensor simulator configuration. */
static sensorsim_state_t m_heart_rate_sim_state;          /**< Heart Rate sensor simulator state. */
static sensorsim_cfg_t   m_rr_interval_sim_cfg;           /**< RR Interval sensor simulator configuration. */
static sensorsim_state_t m_rr_interval_sim_state;         /**< RR Interval sensor simulator state. */

static osTimerId m_battery_timer_id;                      /**< Battery timer. */
static osTimerId m_heart_rate_timer_id;                   /**< Heart rate measurement timer. */
static osTimerId m_rr_interval_timer_id;                  /**< RR interval timer. */
static osTimerId m_sensor_contact_timer_id;               /**< Sensor contact detected timer. */

static ble_uuid_t m_adv_uuids[] =                         /**< Universally unique service identifiers. */
{
    {BLE_UUID_HEART_RATE_SERVICE, BLE_UUID_TYPE_BLE},
    {BLE_UUID_BATTERY_SERVICE, BLE_UUID_TYPE_BLE},
    {BLE_UUID_DEVICE_INFORMATION_SERVICE, BLE_UUID_TYPE_BLE}
};

static void battery_level_meas_timeout_handler(void const * p_context);      /**< Battery timeout handler. */
static void heart_rate_meas_timeout_handler(void const * p_context);         /**< Heart rate measurement timeout handler. */
static void rr_interval_timeout_handler(void const * p_context);             /**< RR interval timeout handler. */
static void sensor_contact_detected_timeout_handler(void const * p_context); /**< Sensor contact detected timeout handler. */

osTimerDef(battery_timer, battery_level_meas_timeout_handler);               /**< Definition of battery timer. */
osTimerDef(heart_rate_timer, heart_rate_meas_timeout_handler);               /**< Definition of heart rate timer. */
osTimerDef(rr_interval_timer, rr_interval_timeout_handler);                  /**< Definition of RR interval timer. */
osTimerDef(sensor_contact_timer, sensor_contact_detected_timeout_handler);   /**< Definition of sensor contact detected timer. */

osPoolDef(ble_evt_pool, 8, ble_evt_t);                                       /**< Definition of memory pool for ble_stack_thread */
osPoolId ble_evt_pool;                                                       /**< Memory pool for ble_stack_thread */
osMessageQDef(ble_stack_msg_box, 8, ble_evt_t);                              /**< Definition of message box for ble_stack_thread */
osMessageQId ble_stack_msg_box;                                              /**< Message box for ble_stack_thread */

osThreadId ble_stack_thread_id;                                              /**< BLE Stack thread */

void ble_stack_thread(void const * arg);
osThreadDef(ble_stack_thread, osPriorityAboveNormal, 1, 0); /**< Definition of BLE Stack thread */
static void advertising_start(void);


/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in]   line_num   Line number of the failing ASSERT call.
 * @param[in]   file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Function for handling Peer Manager events.
 *
 * @param[in] p_evt  Peer Manager event.
 */
static void pm_evt_handler(pm_evt_t const * p_evt)
{
    ret_code_t err_code;

    switch (p_evt->evt_id)
    {
        case PM_EVT_BONDED_PEER_CONNECTED:
        {
            NRF_LOG_INFO("Connected to a previously bonded device.\r\n");
        } break;

        case PM_EVT_CONN_SEC_SUCCEEDED:
        {
            NRF_LOG_INFO("Connection secured. Role: %d. conn_handle: %d, Procedure: %d\r\n",
                         ble_conn_state_role(p_evt->conn_handle),
                         p_evt->conn_handle,
                         p_evt->params.conn_sec_succeeded.procedure);
        } break;

        case PM_EVT_CONN_SEC_FAILED:
        {
            /* Often, when securing fails, it shouldn't be restarted, for security reasons.
             * Other times, it can be restarted directly.
             * Sometimes it can be restarted, but only after changing some Security Parameters.
             * Sometimes, it cannot be restarted until the link is disconnected and reconnected.
             * Sometimes it is impossible, to secure the link, or the peer device does not support it.
             * How to handle this error is highly application dependent. */
        } break;

        case PM_EVT_CONN_SEC_CONFIG_REQ:
        {
            // Reject pairing request from an already bonded peer.
            pm_conn_sec_config_t conn_sec_config = {.allow_repairing = false};
            pm_conn_sec_config_reply(p_evt->conn_handle, &conn_sec_config);
        } break;

