heardrwt/Xiaomi-M365-Display/nRF5_SDK/examples/ble_peripheral/ble_app_hrs_rtx/main.c
    UNUSED_PARAMETER(arg);

    while (1)
    {
        evt = osMessageGet(ble_stack_msg_box, osWaitForever); // wait for message

        if (evt.status == osEventMessage)
        {
            p_ble_evt = evt.value.p;

            switch (p_ble_evt->header.evt_id)
            {
                case BLE_GAP_EVT_CONNECTED:
                    NRF_LOG_INFO("Connected\r\n");
                    err_code = bsp_indication_set(BSP_INDICATE_CONNECTED);
                    APP_ERROR_CHECK(err_code);
                    m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
                    break; // BLE_GAP_EVT_CONNECTED

                case BLE_GAP_EVT_DISCONNECTED:
                    NRF_LOG_INFO("Disconnected\r\n");
                    m_conn_handle = BLE_CONN_HANDLE_INVALID;
                    break; // BLE_GAP_EVT_DISCONNECTED

                case BLE_GATTC_EVT_TIMEOUT:
                    // Disconnect on GATT Client timeout event.
                    NRF_LOG_DEBUG("GATT Client Timeout.\r\n");
                    err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
                                                     BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
                    APP_ERROR_CHECK(err_code);
                    break; // BLE_GATTC_EVT_TIMEOUT

                case BLE_GATTS_EVT_TIMEOUT:
                    // Disconnect on GATT Server timeout event.
                    NRF_LOG_DEBUG("GATT Server Timeout.\r\n");
                    err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
                                                     BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
                    APP_ERROR_CHECK(err_code);
                    break; // BLE_GATTS_EVT_TIMEOUT

                case BLE_EVT_USER_MEM_REQUEST:
                    err_code = sd_ble_user_mem_reply(m_conn_handle, NULL);
                    APP_ERROR_CHECK(err_code);
                    break; // BLE_EVT_USER_MEM_REQUEST

                case BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST:
                {
                    ble_gatts_evt_rw_authorize_request_t  req;
                    ble_gatts_rw_authorize_reply_params_t auth_reply;

                    req = p_ble_evt->evt.gatts_evt.params.authorize_request;

                    if (req.type != BLE_GATTS_AUTHORIZE_TYPE_INVALID)
                    {
                        if ((req.request.write.op == BLE_GATTS_OP_PREP_WRITE_REQ)     ||
                            (req.request.write.op == BLE_GATTS_OP_EXEC_WRITE_REQ_NOW) ||
                            (req.request.write.op == BLE_GATTS_OP_EXEC_WRITE_REQ_CANCEL))
                        {
                            if (req.type == BLE_GATTS_AUTHORIZE_TYPE_WRITE)
                            {
                                auth_reply.type = BLE_GATTS_AUTHORIZE_TYPE_WRITE;
                            }
                            else
                            {
                                auth_reply.type = BLE_GATTS_AUTHORIZE_TYPE_READ;
                            }
                            auth_reply.params.write.gatt_status = APP_FEATURE_NOT_SUPPORTED;
                            err_code = sd_ble_gatts_rw_authorize_reply(m_conn_handle,&auth_reply);
                            APP_ERROR_CHECK(err_code);
                        }
                    }
                } break; // BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST

                default:
                    // No implementation needed.
                    break;
            }
            (void)osPoolFree(ble_evt_pool, p_ble_evt);
        }
    }
}


/**@brief Function for handling events from the BSP module.
 *
 * @param[in]   event   Event generated by button press.
 */
static void bsp_event_handler(bsp_event_t event)
{
    uint32_t err_code;

    switch (event)
    {
        case BSP_EVENT_SLEEP:
            sleep_mode_enter();
            break;

        case BSP_EVENT_DISCONNECT:
            err_code = sd_ble_gap_disconnect(m_conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (err_code != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK(err_code);
            }
            break;

        default:
            break;
    }
}


/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
    uint32_t               err_code;
    ble_advdata_t          advdata;
    ble_adv_modes_config_t options;

    // Build and set advertising data
    memset(&advdata, 0, sizeof(advdata));

    advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    advdata.include_appearance      = true;
    advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    advdata.uuids_complete.p_uuids  = m_adv_uuids;

    memset(&options, 0, sizeof(options));
    options.ble_adv_fast_enabled  = true;
    options.ble_adv_fast_interval = APP_ADV_INTERVAL;
    options.ble_adv_fast_timeout  = APP_ADV_TIMEOUT_IN_SECONDS;

    err_code = ble_advertising_init(&advdata, NULL, &options, on_adv_evt, NULL);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;

    uint32_t err_code = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS,
                                 APP_TIMER_TICKS(100, APP_TIMER_PRESCALER),
                                 bsp_event_handler);

    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
    uint32_t err_code = ble_advertising_start(BLE_ADV_MODE_FAST);

    APP_ERROR_CHECK(err_code);
}


/**@brief Function for application main entry.
 */
int main(void)
{
    uint32_t err_code;
    bool     erase_bonds;

    // Initialize.
      err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    timers_init();
    buttons_leds_init(&erase_bonds);
    ble_stack_init();
    peer_manager_init(erase_bonds);
    if (erase_bonds == true)
    {
        NRF_LOG_INFO("Bonds erased!\r\n");
    }
    gap_params_init();
    advertising_init();
    services_init();
    sensor_simulator_init();
    conn_params_init();

    ble_evt_pool      = osPoolCreate(osPool(ble_evt_pool));
    ble_stack_msg_box = osMessageCreate(osMessageQ(ble_stack_msg_box), NULL);

    // Start execution.
    NRF_LOG_INFO("Heart Rate Sensor Start!\r\n");
    ble_stack_thread_id = osThreadCreate(osThread(ble_stack_thread), NULL);
    UNUSED_VARIABLE(ble_stack_thread_id);
    application_timers_start();
    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);

    // Enter main loop.
    for (;;)
    {
                NRF_LOG_FLUSH();
        UNUSED_VARIABLE(osDelay(1000));
    }
}


